name: "MINND_v1"
# Data layer for storing input images
# These images are the results of the MOSES forward model
layer{
	name: 	"minnd_input"
	type: 	"HDF5Data"
	top:	"data"
	top:	"label"
	
	include {
		phase: TEST
	}
	
	hdf5_data_param {
		source: "/minnd/datasets/levelB/test_index.txt"
		batch_size: 2000
	}
}

layer{
	name: 	"minnd_input"
	type: 	"HDF5Data"
	top:	"data"
	top:	"label"
	
	include {
		phase: TRAIN
	}
	
	hdf5_data_param {
		source: "/minnd/datasets/levelB/train_index.txt"
		batch_size: 1000
	}
}




# Third Convolutional Layer
layer {
	name: 	"conv3"
	type: 	"Deconvolution"
	bottom: "data"
	top: 	"conv3"
	
	# learning rate and decay multipliers for the filters
	param { lr_mult: 1 decay_mult: 1 }
  	# learning rate and decay multipliers for the biases
  	param { lr_mult: 2 decay_mult: 0 }
  
	convolution_param {	
	  	num_output:		32
	  	kernel_h:		21
		kernel_w:		21	
	  	stride_h:		1
		stride_w:		1
		pad_h:			10
		pad_w:			10
	  
	  	weight_filler {
		  	type: "gaussian" # initialize the filters from a Gaussian
		  	std: 0.01       # distribution with stdev 0.001 (default mean: 0)
		}
		bias_filler {
		  	type: "constant" # initialize the biases to zero (0)
		  	value: 0
		}
    }
}

layer {
	name: 	"conv3_act"
	type:	"ReLU"
	bottom:	"conv3"
	top:	"conv3"
}


# Fourth Convolutional Layer
layer {
	name: 	"conv4"
	type: 	"Deconvolution"
	bottom: "conv3"
	top: 	"conv4"
	
	# learning rate and decay multipliers for the filters
	param { lr_mult: 1 decay_mult: 1 }
  	# learning rate and decay multipliers for the biases
  	param { lr_mult: 2 decay_mult: 0 }
  
	convolution_param {	
	  	num_output:		1
	  	kernel_h:		21
		kernel_w:		21	
	  	stride_h:		1
		stride_w:		1
		pad_h:			10
		pad_w:			10
	  
	  	weight_filler {
		  	type: "gaussian" # initialize the filters from a Gaussian
		  	std: 0.01       # distribution with stdev 0.001 (default mean: 0)
		}
		bias_filler {
		  	type: "constant" # initialize the biases to zero (0)
		  	value: 0
		}
    }
}

layer {
	name: "loss"
	type: "EuclideanLoss"
	bottom: "conv4"
	bottom: "label"
	top: "loss"	
}

layer {
	type: "HDF5Output"
	name: "test1"
	bottom: "conv3" 
	bottom: "conv3" 
	hdf5_output_param {
		file_name: "test1.h5"
	}
	include { phase: TEST }
}

layer {
	type: "HDF5Output"
	name: "test2"
	bottom: "conv3" 
	bottom: "conv3" 
	hdf5_output_param {
		file_name: "test2.h5"
	}
	include { phase: TEST }
}

layer {
	type: "HDF5Output"
	name: "test3"
	bottom: "conv3" 
	bottom: "conv3"
	hdf5_output_param {
		file_name: "test3.h5"
	}
	include { phase: TEST }
}

layer {
	type: "HDF5Output"
	name: "test4"
	bottom: "conv3" 
	bottom: "conv3"
	hdf5_output_param {
		file_name: "test4.h5"
	}
	include { phase: TEST }
}

layer {
	type: "HDF5Output"
	name: "hdf5input"
	bottom: "data" 
	bottom: "data" 
	hdf5_output_param {
		file_name: "input.h5"
	}
	include { phase: TEST }
}

layer {
	type: "HDF5Output"
	name: "hdf5output"
	bottom: "conv4" 
	bottom: "conv4" 
	hdf5_output_param {
		file_name: "output.h5"
	}
	include { phase: TEST }
}

layer {
	type: "HDF5Output"
	name: "hdf5truth"
	bottom: "label" 
	bottom: "label"
	hdf5_output_param {
		file_name: "truth.h5"
	}
	include { phase: TEST }
}













